#  Q.1 Cutlets

In [14]:
import pandas as pd
import numpy as np
from scipy import stats
from scipy.stats import norm

# H0:there is no significant         difference in the diameter of the cutlet between two units.
# H1:there is  significant difference in the diameter of the cutlet between two units.

In [5]:
#load the dataset
data=pd.read_csv("E://Pune dataseince assignment//Cutlets (1).csv")

In [8]:
data.head()

   Unit A  Unit B
0  6.8090  6.7703
1  6.4376  7.5093
2  6.9157  6.7300
3  7.3012  6.7878
4  7.4488  7.1522

In [10]:
unitA=pd.Series(data.iloc[:,0])
unitA

0     6.8090
1     6.4376
2     6.9157
3     7.3012
4     7.4488
5     7.3871
6     6.8755
7     7.0621
8     6.6840
9     6.8236
10    7.3930
11    7.5169
12    6.9246
13    6.9256
14    6.5797
15    6.8394
16    6.5970
17    7.2705
18    7.2828
19    7.3495
20    6.9438
21    7.1560
22    6.5341
23    7.2854
24    6.9952
25    6.8568
26    7.2163
27    6.6801
28    6.9431
29    7.0852
30    6.7794
31    7.2783
32    7.1561
33    7.3943
34    6.9405
Name: Unit A, dtype: float64

In [15]:
unitB=pd.Series(data.iloc[:,1])
unitB

0     6.7703
1     7.5093
2     6.7300
3     6.7878
4     7.1522
5     6.8110
6     7.2212
7     6.6606
8     7.2402
9     7.0503
10    6.8810
11    7.4059
12    6.7652
13    6.0380
14    7.1581
15    7.0240
16    6.6672
17    7.4314
18    7.3070
19    6.7478
20    6.8889
21    7.4220
22    6.5217
23    7.1688
24    6.7594
25    6.9399
26    7.0133
27    6.9182
28    6.3346
29    7.5459
30    7.0992
31    7.1180
32    6.6965
33    6.5780
34    7.3875
Name: Unit B, dtype: float64

In [19]:
# 2-sample 2-tail ttest: stats.ttest_ind
p_value=stats.ttest_ind(unitA,unitB)
p_value

Ttest_indResult(statistic=0.7228688704678063, pvalue=0.4722394724599501)

In [18]:
p_value[1] # 2-tail probability

0.4722394724599501

# Conclusion:P-values is greater than 0.05. so we reject H0 there is significant difference in the diameter of the cutlet betwwen two unites

 # load the LabTAT(Q.2)

# H0:there is any difference in average 
# H1: there is not any difference in average

In [24]:
Labtat=pd.read_csv("E://Pune dataseince assignment//LabTAT (1).csv")
Labtat

     Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0          185.35        165.53        176.70        166.13
1          170.49        185.91        198.45        160.79
2          192.77        194.92        201.23        185.18
3          177.33        183.00        199.61        176.42
4          193.41        169.57        204.63        152.60
..            ...           ...           ...           ...
115        178.49        170.66        193.80        172.68
116        176.08        183.98        215.25        177.64
117        202.48        174.54        203.99        170.27
118        182.40        197.18        194.52        150.87
119        182.09        215.17        221.49        162.21

[120 rows x 4 columns]

In [25]:
Labtat.describe()

       Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
count    120.000000    120.000000    120.000000     120.00000
mean     178.361583    178.902917    199.913250     163.68275
std       13.173594     14.957114     16.539033      15.08508
min      138.300000    140.550000    159.690000     124.06000
25%      170.335000    168.025000    188.232500     154.05000
50%      178.530000    178.870000    199.805000     164.42500
75%      186.535000    189.112500    211.332500     172.88250
max      216.390000    217.860000    238.700000     205.18000

In [27]:
Labtat.head()

   Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0        185.35        165.53        176.70        166.13
1        170.49        185.91        198.45        160.79
2        192.77        194.92        201.23        185.18
3        177.33        183.00        199.61        176.42
4        193.41        169.57        204.63        152.60

In [28]:
Labtat.tail()

     Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
115        178.49        170.66        193.80        172.68
116        176.08        183.98        215.25        177.64
117        202.48        174.54        203.99        170.27
118        182.40        197.18        194.52        150.87
119        182.09        215.17        221.49        162.21

In [56]:
# Anova F -test statisrics stats.f_oneway(column-1,column-2,column-3,column-4)
import scipy.stats as stats;
stats.f_oneway(Labtat.iloc[:,0],Labtat.iloc[:,1],Labtat.iloc[:,2])

F_onewayResult(statistic=81.055779144798, pvalue=9.489467524356218e-30)

# Here p-value is greater than 0.05 so we reject H0 and conclude that there is significant difference between there is not any difference in average

# BuyerRatio (Q.3)

In [33]:
import pandas as pd
import numpy as np
from scipy import stats
from scipy.stats import norm
from scipy.stats import chi2_contingency

 # H0: All proportion are equal
 # H1: Not all Proportion are equal

In [55]:
# load the dataset
data=pd.read_csv("E://Pune dataseince assignment//BuyerRatio (1).csv")
data

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

In [40]:
# Make dimensional array
df=np.array([[50,142,131,70],[435,1523,1356,750]])
df

array([[  50,  142,  131,   70],
       [ 435, 1523, 1356,  750]])

In [45]:
stat,p,dof,expected=chi2_contingency(df) 
alpha=0.05
print("p Value is "+ str(p))

p Value is 0.6603094907091882

 # Here p-value is greater than 0.05 so we reject H0 and conclude that all proportion are equal

# Q.4(Costomer+OrderForm (1))

In [46]:
import pandas as pd
import numpy as np
from scipy import stats
from scipy.stats import norm
from scipy.stats import chi2_contingency

# H0:there is no significant difference between defective %  varies by centre
# H1:there is  significant difference between defective %  varies by centre

In [48]:
# load the dataset
data=pd.read_csv("E://Pune dataseince assignment//Costomer+OrderForm (1).csv")
data

    Phillippines   Indonesia       Malta       India
0     Error Free  Error Free   Defective  Error Free
1     Error Free  Error Free  Error Free   Defective
2     Error Free   Defective   Defective  Error Free
3     Error Free  Error Free  Error Free  Error Free
4     Error Free  Error Free   Defective  Error Free
..           ...         ...         ...         ...
295   Error Free  Error Free  Error Free  Error Free
296   Error Free  Error Free  Error Free  Error Free
297   Error Free  Error Free   Defective  Error Free
298   Error Free  Error Free  Error Free  Error Free
299   Error Free   Defective   Defective  Error Free

[300 rows x 4 columns]

In [49]:
data.Phillippines.value_counts()

Error Free    271
Defective      29
Name: Phillippines, dtype: int64

In [50]:
data.Indonesia.value_counts()

Error Free    267
Defective      33
Name: Indonesia, dtype: int64

In [51]:
data.Malta.value_counts()

Error Free    269
Defective      31
Name: Malta, dtype: int64

In [52]:
data.India.value_counts()

Error Free    280
Defective      20
Name: India, dtype: int64

In [54]:
# Make a Contingency table
obs=np.array([[271,267,269,280],[29,33,31,20]])
stat,p,dof,expected=chi2_contingency(obs) 
alpha=0.05
print("p Value is "+ str(p))

p Value is 0.2771020991233135

# Here p-value is greater than 0.05 so we reject H0 and conclude that there is significant difference between defective % varies by centre